# running in formal/src/
read -formal grammar_fsm.v
prep -top grammar_fsm

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
